content/posts/my-first-post.md
+++
title = "My first post"
date = 2022-11-10
tags = ["meta", "beginning"]
draft = false
+++

Hi,

I frankly don't know where to begin, but I am glad you _somehow_ found
your way here.


## Why {#why}

The entire reason behind me starting this was a braindump. You may
share the same experience of gulping down a large amount of coffee,
flexing your fingers, and browsing the web or frantically coding away
at your mechanical keyboard.

Whatever it may be, many of those great days (and nights) ended up being
wasted for not writing down what I did, learned, discovered,
regretted, etc.

After a while, I decided to write these down, and what do you know, it
ended up being so much content that I was blown away. Showing cool
code snippets to friends on Discord became a bit annoying (mostly for
them). Instead, I decided to share these experiences with like-minded
folks and those who may wanna know what the end of the rabbithole
looks like for some piece of technology.


## Who {#who}

I'm [Arian](https://github.com/arian-d). A recent graduate with a B.S. in Computer Science. I like
weird programming languages, operating systems, cybersecurity, and
almost all things that pertain to software.


## What {#what}

I am going to write about _many_ things that I've done and plan on
doing. Is it going to be [Emacs](https://www.gnu.org/software/emacs/)? [OpenBSD](https://www.openbsd.org/)? [Gentoo](https://www.gentoo.org/)? [Podman](https://podman.io/)? [ZFS](https://openzfs.org/wiki/Main_Page)?

The answer to all of those is an absolute **yes**. The only thing holding
me back is time and more caffeine. I implore you to click on as many
links as you see here (provided you hover and they're not suspicious),
and search anything that makes you curious.

With all this content comes the disadvantage of deterring people who
may not find certain topics interesting. Some InfoSec folk shiver when
there's mathy programming involved, and DevOps experts will yawn at
the sight of "yet another docker and k8s 101 guide". This is _exactly_
why I find blogs to be <span class="underline">perfect</span>; one can simply filter by tags and jump
to the title they find interesting, so please, do judge this book by
its cover 🙂.


## Inspiration {#inspiration}

At the moment there's nothing here, but I wanna give my pre-thanks to
blogs and websites that inspired me to start my own.

-   [Chris Wellons](https://github.com/skeeto)' [Null program](https://nullprogram.com/)
-   [Xe](https://xeiaso.net/)'s mind-blowing [blog](https://xeiaso.net/blog)
-   [Jethro Kuan](https://www.jethro.dev/)'s  [braindump](https://braindump.jethro.dev/)
